Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpd100.h
extern volatile __IC16CONbits_t IC16CONbits __asm__ ("IC16CON") __attribute__((section("sfrs"), address(0xBF843E00)));
extern volatile uint32_t        IC16CONCLR __attribute__((section("sfrs"),address(0xBF843E04)));
extern volatile uint32_t        IC16CONSET __attribute__((section("sfrs"),address(0xBF843E08)));
extern volatile uint32_t        IC16CONINV __attribute__((section("sfrs"),address(0xBF843E0C)));
#define IC16BUF IC16BUF
extern volatile uint32_t   IC16BUF __attribute__((section("sfrs"), address(0xBF843E10)));
#define OC10CON OC10CON
extern volatile uint32_t   OC10CON __attribute__((section("sfrs"), address(0xBF845200)));
typedef union {
  struct {
    uint32_t OCM:3;
    uint32_t OCTSEL:1;
    uint32_t OCFLT:1;
    uint32_t OC32:1;
    uint32_t :7;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t OCM0:1;
    uint32_t OCM1:1;
    uint32_t OCM2:1;
  };
  struct {
    uint32_t :13;
    uint32_t OCSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __OC10CONbits_t;
extern volatile __OC10CONbits_t OC10CONbits __asm__ ("OC10CON") __attribute__((section("sfrs"), address(0xBF845200)));
extern volatile uint32_t        OC10CONCLR __attribute__((section("sfrs"),address(0xBF845204)));
extern volatile uint32_t        OC10CONSET __attribute__((section("sfrs"),address(0xBF845208)));
extern volatile uint32_t        OC10CONINV __attribute__((section("sfrs"),address(0xBF84520C)));
#define OC10R OC10R
extern volatile uint32_t   OC10R __attribute__((section("sfrs"), address(0xBF845210)));
extern volatile uint32_t        OC10RCLR __attribute__((section("sfrs"),address(0xBF845214)));
extern volatile uint32_t        OC10RSET __attribute__((section("sfrs"),address(0xBF845218)));
extern volatile uint32_t        OC10RINV __attribute__((section("sfrs"),address(0xBF84521C)));
#define OC10RS OC10RS
extern volatile uint32_t   OC10RS __attribute__((section("sfrs"), address(0xBF845220)));
extern volatile uint32_t        OC10RSCLR __attribute__((section("sfrs"),address(0xBF845224)));
extern volatile uint32_t        OC10RSSET __attribute__((section("sfrs"),address(0xBF845228)));
extern volatile uint32_t        OC10RSINV __attribute__((section("sfrs"),address(0xBF84522C)));
#define OC11CON OC11CON
extern volatile uint32_t   OC11CON __attribute__((section("sfrs"), address(0xBF845400)));
typedef union {
  struct {
    uint32_t OCM:3;
    uint32_t OCTSEL:1;
    uint32_t OCFLT:1;
    uint32_t OC32:1;
    uint32_t :7;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t OCM0:1;
    uint32_t OCM1:1;
    uint32_t OCM2:1;
  };
  struct {
    uint32_t :13;
    uint32_t OCSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __OC11CONbits_t;
extern volatile __OC11CONbits_t OC11CONbits __asm__ ("OC11CON") __attribute__((section("sfrs"), address(0xBF845400)));
extern volatile uint32_t        OC11CONCLR __attribute__((section("sfrs"),address(0xBF845404)));
extern volatile uint32_t        OC11CONSET __attribute__((section("sfrs"),address(0xBF845408)));
extern volatile uint32_t        OC11CONINV __attribute__((section("sfrs"),address(0xBF84540C)));
#define OC11R OC11R
extern volatile uint32_t   OC11R __attribute__((section("sfrs"), address(0xBF845410)));
extern volatile uint32_t        OC11RCLR __attribute__((section("sfrs"),address(0xBF845414)));
extern volatile uint32_t        OC11RSET __attribute__((section("sfrs"),address(0xBF845418)));
extern volatile uint32_t        OC11RINV __attribute__((section("sfrs"),address(0xBF84541C)));
#define OC11RS OC11RS
extern volatile uint32_t   OC11RS __attribute__((section("sfrs"), address(0xBF845420)));
extern volatile uint32_t        OC11RSCLR __attribute__((section("sfrs"),address(0xBF845424)));
extern volatile uint32_t        OC11RSSET __attribute__((section("sfrs"),address(0xBF845428)));
extern volatile uint32_t        OC11RSINV __attribute__((section("sfrs"),address(0xBF84542C)));
#define OC12CON OC12CON
extern volatile uint32_t   OC12CON __attribute__((section("sfrs"), address(0xBF845600)));
typedef union {
  struct {
    uint32_t OCM:3;
    uint32_t OCTSEL:1;
    uint32_t OCFLT:1;
    uint32_t OC32:1;
    uint32_t :7;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t OCM0:1;
    uint32_t OCM1:1;
    uint32_t OCM2:1;
  };
  struct {
    uint32_t :13;
    uint32_t OCSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __OC12CONbits_t;
extern volatile __OC12CONbits_t OC12CONbits __asm__ ("OC12CON") __attribute__((section("sfrs"), address(0xBF845600)));
extern volatile uint32_t        OC12CONCLR __attribute__((section("sfrs"),address(0xBF845604)));
extern volatile uint32_t        OC12CONSET __attribute__((section("sfrs"),address(0xBF845608)));
extern volatile uint32_t        OC12CONINV __attribute__((section("sfrs"),address(0xBF84560C)));
#define OC12R OC12R
extern volatile uint32_t   OC12R __attribute__((section("sfrs"), address(0xBF845610)));
extern volatile uint32_t        OC12RCLR __attribute__((section("sfrs"),address(0xBF845614)));
extern volatile uint32_t        OC12RSET __attribute__((section("sfrs"),address(0xBF845618)));
extern volatile uint32_t        OC12RINV __attribute__((section("sfrs"),address(0xBF84561C)));
#define OC12RS OC12RS
extern volatile uint32_t   OC12RS __attribute__((section("sfrs"), address(0xBF845620)));
extern volatile uint32_t        OC12RSCLR __attribute__((section("sfrs"),address(0xBF845624)));
extern volatile uint32_t        OC12RSSET __attribute__((section("sfrs"),address(0xBF845628)));
extern volatile uint32_t        OC12RSINV __attribute__((section("sfrs"),address(0xBF84562C)));
#define OC13CON OC13CON
extern volatile uint32_t   OC13CON __attribute__((section("sfrs"), address(0xBF845800)));
typedef union {
  struct {
    uint32_t OCM:3;
    uint32_t OCTSEL:1;
    uint32_t OCFLT:1;
    uint32_t OC32:1;
    uint32_t :7;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t OCM0:1;
    uint32_t OCM1:1;
    uint32_t OCM2:1;
  };
  struct {
    uint32_t :13;
    uint32_t OCSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __OC13CONbits_t;
extern volatile __OC13CONbits_t OC13CONbits __asm__ ("OC13CON") __attribute__((section("sfrs"), address(0xBF845800)));
extern volatile uint32_t        OC13CONCLR __attribute__((section("sfrs"),address(0xBF845804)));
extern volatile uint32_t        OC13CONSET __attribute__((section("sfrs"),address(0xBF845808)));
extern volatile uint32_t        OC13CONINV __attribute__((section("sfrs"),address(0xBF84580C)));
#define OC13R OC13R
extern volatile uint32_t   OC13R __attribute__((section("sfrs"), address(0xBF845810)));
extern volatile uint32_t        OC13RCLR __attribute__((section("sfrs"),address(0xBF845814)));
extern volatile uint32_t        OC13RSET __attribute__((section("sfrs"),address(0xBF845818)));
extern volatile uint32_t        OC13RINV __attribute__((section("sfrs"),address(0xBF84581C)));
#define OC13RS OC13RS
extern volatile uint32_t   OC13RS __attribute__((section("sfrs"), address(0xBF845820)));
extern volatile uint32_t        OC13RSCLR __attribute__((section("sfrs"),address(0xBF845824)));
extern volatile uint32_t        OC13RSSET __attribute__((section("sfrs"),address(0xBF845828)));
extern volatile uint32_t        OC13RSINV __attribute__((section("sfrs"),address(0xBF84582C)));
#define OC14CON OC14CON
extern volatile uint32_t   OC14CON __attribute__((section("sfrs"), address(0xBF845A00)));
typedef union {
  struct {
    uint32_t OCM:3;
    uint32_t OCTSEL:1;
    uint32_t OCFLT:1;
    uint32_t OC32:1;
    uint32_t :7;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t OCM0:1;
    uint32_t OCM1:1;
    uint32_t OCM2:1;
  };
  struct {
    uint32_t :13;
    uint32_t OCSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __OC14CONbits_t;
extern volatile __OC14CONbits_t OC14CONbits __asm__ ("OC14CON") __attribute__((section("sfrs"), address(0xBF845A00)));
extern volatile uint32_t        OC14CONCLR __attribute__((section("sfrs"),address(0xBF845A04)));
extern volatile uint32_t        OC14CONSET __attribute__((section("sfrs"),address(0xBF845A08)));
extern volatile uint32_t        OC14CONINV __attribute__((section("sfrs"),address(0xBF845A0C)));
#define OC14R OC14R
extern volatile uint32_t   OC14R __attribute__((section("sfrs"), address(0xBF845A10)));
extern volatile uint32_t        OC14RCLR __attribute__((section("sfrs"),address(0xBF845A14)));
extern volatile uint32_t        OC14RSET __attribute__((section("sfrs"),address(0xBF845A18)));
extern volatile uint32_t        OC14RINV __attribute__((section("sfrs"),address(0xBF845A1C)));
#define OC14RS OC14RS
extern volatile uint32_t   OC14RS __attribute__((section("sfrs"), address(0xBF845A20)));
extern volatile uint32_t        OC14RSCLR __attribute__((section("sfrs"),address(0xBF845A24)));
extern volatile uint32_t        OC14RSSET __attribute__((section("sfrs"),address(0xBF845A28)));
extern volatile uint32_t        OC14RSINV __attribute__((section("sfrs"),address(0xBF845A2C)));
#define OC15CON OC15CON
extern volatile uint32_t   OC15CON __attribute__((section("sfrs"), address(0xBF845C00)));
typedef union {
  struct {
    uint32_t OCM:3;
    uint32_t OCTSEL:1;
    uint32_t OCFLT:1;
    uint32_t OC32:1;
    uint32_t :7;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t OCM0:1;
    uint32_t OCM1:1;
    uint32_t OCM2:1;
  };
  struct {
    uint32_t :13;
    uint32_t OCSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __OC15CONbits_t;
