Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpd100.h
extern volatile __U3BRGbits_t U3BRGbits __asm__ ("U3BRG") __attribute__((section("sfrs"), address(0xBF848440)));
extern volatile uint32_t        U3BRGCLR __attribute__((section("sfrs"),address(0xBF848444)));
extern volatile uint32_t        U3BRGSET __attribute__((section("sfrs"),address(0xBF848448)));
extern volatile uint32_t        U3BRGINV __attribute__((section("sfrs"),address(0xBF84844C)));
#define U4MODE U4MODE
extern volatile uint32_t   U4MODE __attribute__((section("sfrs"), address(0xBF848600)));
typedef union {
  struct {
    uint32_t STSEL:1;
    uint32_t PDSEL:2;
    uint32_t BRGH:1;
    uint32_t RXINV:1;
    uint32_t ABAUD:1;
    uint32_t LPBACK:1;
    uint32_t WAKE:1;
    uint32_t UEN:2;
    uint32_t :1;
    uint32_t RTSMD:1;
    uint32_t IREN:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t OVFDIS:1;
    uint32_t CLKSEL:2;
    uint32_t :3;
    uint32_t ACTIVE:1;
    uint32_t SLPEN:1;
  };
  struct {
    uint32_t :16;
    uint32_t RUNOVF:1;
  };
  struct {
    uint32_t :1;
    uint32_t PDSEL0:1;
    uint32_t PDSEL1:1;
    uint32_t :5;
    uint32_t UEN0:1;
    uint32_t UEN1:1;
  };
  struct {
    uint32_t :13;
    uint32_t USIDL:1;
    uint32_t :1;
    uint32_t UARTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __U4MODEbits_t;
extern volatile __U4MODEbits_t U4MODEbits __asm__ ("U4MODE") __attribute__((section("sfrs"), address(0xBF848600)));
extern volatile uint32_t        U4MODECLR __attribute__((section("sfrs"),address(0xBF848604)));
extern volatile uint32_t        U4MODESET __attribute__((section("sfrs"),address(0xBF848608)));
extern volatile uint32_t        U4MODEINV __attribute__((section("sfrs"),address(0xBF84860C)));
#define U4STA U4STA
extern volatile uint32_t   U4STA __attribute__((section("sfrs"), address(0xBF848610)));
typedef union {
  struct {
    uint32_t URXDA:1;
    uint32_t OERR:1;
    uint32_t FERR:1;
    uint32_t PERR:1;
    uint32_t RIDLE:1;
    uint32_t ADDEN:1;
    uint32_t URXISEL:2;
    uint32_t TRMT:1;
    uint32_t UTXBF:1;
    uint32_t UTXEN:1;
    uint32_t UTXBRK:1;
    uint32_t URXEN:1;
    uint32_t UTXINV:1;
    uint32_t UTXISEL:2;
    uint32_t ADDR:8;
    uint32_t MASK:8;
  };
  struct {
    uint32_t :6;
    uint32_t URXISEL0:1;
    uint32_t URXISEL1:1;
    uint32_t :6;
    uint32_t UTXISEL0:1;
    uint32_t UTXISEL1:1;
  };
  struct {
    uint32_t :14;
    uint32_t UTXSEL:2;
  };
  struct {
    uint32_t w:32;
  };
} __U4STAbits_t;
extern volatile __U4STAbits_t U4STAbits __asm__ ("U4STA") __attribute__((section("sfrs"), address(0xBF848610)));
extern volatile uint32_t        U4STACLR __attribute__((section("sfrs"),address(0xBF848614)));
extern volatile uint32_t        U4STASET __attribute__((section("sfrs"),address(0xBF848618)));
extern volatile uint32_t        U4STAINV __attribute__((section("sfrs"),address(0xBF84861C)));
#define U4TXREG U4TXREG
extern volatile uint32_t   U4TXREG __attribute__((section("sfrs"), address(0xBF848620)));
#define U4RXREG U4RXREG
extern volatile uint32_t   U4RXREG __attribute__((section("sfrs"), address(0xBF848630)));
#define U4BRG U4BRG
extern volatile uint32_t   U4BRG __attribute__((section("sfrs"), address(0xBF848640)));
typedef struct {
  uint32_t BRG:20;
} __U4BRGbits_t;
extern volatile __U4BRGbits_t U4BRGbits __asm__ ("U4BRG") __attribute__((section("sfrs"), address(0xBF848640)));
extern volatile uint32_t        U4BRGCLR __attribute__((section("sfrs"),address(0xBF848644)));
extern volatile uint32_t        U4BRGSET __attribute__((section("sfrs"),address(0xBF848648)));
extern volatile uint32_t        U4BRGINV __attribute__((section("sfrs"),address(0xBF84864C)));
#define U5MODE U5MODE
extern volatile uint32_t   U5MODE __attribute__((section("sfrs"), address(0xBF848800)));
typedef union {
  struct {
    uint32_t STSEL:1;
    uint32_t PDSEL:2;
    uint32_t BRGH:1;
    uint32_t RXINV:1;
    uint32_t ABAUD:1;
    uint32_t LPBACK:1;
    uint32_t WAKE:1;
    uint32_t UEN:2;
    uint32_t :1;
    uint32_t RTSMD:1;
    uint32_t IREN:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t OVFDIS:1;
    uint32_t CLKSEL:2;
    uint32_t :3;
    uint32_t ACTIVE:1;
    uint32_t SLPEN:1;
  };
  struct {
    uint32_t :16;
    uint32_t RUNOVF:1;
  };
  struct {
    uint32_t :1;
    uint32_t PDSEL0:1;
    uint32_t PDSEL1:1;
    uint32_t :5;
    uint32_t UEN0:1;
    uint32_t UEN1:1;
  };
  struct {
    uint32_t :13;
    uint32_t USIDL:1;
    uint32_t :1;
    uint32_t UARTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __U5MODEbits_t;
extern volatile __U5MODEbits_t U5MODEbits __asm__ ("U5MODE") __attribute__((section("sfrs"), address(0xBF848800)));
extern volatile uint32_t        U5MODECLR __attribute__((section("sfrs"),address(0xBF848804)));
extern volatile uint32_t        U5MODESET __attribute__((section("sfrs"),address(0xBF848808)));
extern volatile uint32_t        U5MODEINV __attribute__((section("sfrs"),address(0xBF84880C)));
#define U5STA U5STA
extern volatile uint32_t   U5STA __attribute__((section("sfrs"), address(0xBF848810)));
typedef union {
  struct {
    uint32_t URXDA:1;
    uint32_t OERR:1;
    uint32_t FERR:1;
    uint32_t PERR:1;
    uint32_t RIDLE:1;
    uint32_t ADDEN:1;
    uint32_t URXISEL:2;
    uint32_t TRMT:1;
    uint32_t UTXBF:1;
    uint32_t UTXEN:1;
    uint32_t UTXBRK:1;
    uint32_t URXEN:1;
    uint32_t UTXINV:1;
    uint32_t UTXISEL:2;
    uint32_t ADDR:8;
    uint32_t MASK:8;
  };
  struct {
    uint32_t :6;
    uint32_t URXISEL0:1;
    uint32_t URXISEL1:1;
    uint32_t :6;
    uint32_t UTXISEL0:1;
    uint32_t UTXISEL1:1;
  };
  struct {
    uint32_t :14;
    uint32_t UTXSEL:2;
  };
  struct {
    uint32_t w:32;
  };
} __U5STAbits_t;
extern volatile __U5STAbits_t U5STAbits __asm__ ("U5STA") __attribute__((section("sfrs"), address(0xBF848810)));
extern volatile uint32_t        U5STACLR __attribute__((section("sfrs"),address(0xBF848814)));
extern volatile uint32_t        U5STASET __attribute__((section("sfrs"),address(0xBF848818)));
extern volatile uint32_t        U5STAINV __attribute__((section("sfrs"),address(0xBF84881C)));
#define U5TXREG U5TXREG
extern volatile uint32_t   U5TXREG __attribute__((section("sfrs"), address(0xBF848820)));
#define U5RXREG U5RXREG
extern volatile uint32_t   U5RXREG __attribute__((section("sfrs"), address(0xBF848830)));
#define U5BRG U5BRG
extern volatile uint32_t   U5BRG __attribute__((section("sfrs"), address(0xBF848840)));
typedef struct {
  uint32_t BRG:20;
} __U5BRGbits_t;
extern volatile __U5BRGbits_t U5BRGbits __asm__ ("U5BRG") __attribute__((section("sfrs"), address(0xBF848840)));
extern volatile uint32_t        U5BRGCLR __attribute__((section("sfrs"),address(0xBF848844)));
extern volatile uint32_t        U5BRGSET __attribute__((section("sfrs"),address(0xBF848848)));
extern volatile uint32_t        U5BRGINV __attribute__((section("sfrs"),address(0xBF84884C)));
#define U6MODE U6MODE
extern volatile uint32_t   U6MODE __attribute__((section("sfrs"), address(0xBF848A00)));
typedef union {
  struct {
    uint32_t STSEL:1;
    uint32_t PDSEL:2;
    uint32_t BRGH:1;
    uint32_t RXINV:1;
    uint32_t ABAUD:1;
    uint32_t LPBACK:1;
    uint32_t WAKE:1;
    uint32_t UEN:2;
    uint32_t :1;
    uint32_t RTSMD:1;
    uint32_t IREN:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t OVFDIS:1;
    uint32_t CLKSEL:2;
    uint32_t :3;
    uint32_t ACTIVE:1;
    uint32_t SLPEN:1;
  };
  struct {
    uint32_t :16;
    uint32_t RUNOVF:1;
  };
  struct {
    uint32_t :1;
    uint32_t PDSEL0:1;
    uint32_t PDSEL1:1;
    uint32_t :5;
    uint32_t UEN0:1;
    uint32_t UEN1:1;
  };
  struct {
    uint32_t :13;
    uint32_t USIDL:1;
    uint32_t :1;
    uint32_t UARTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __U6MODEbits_t;
extern volatile __U6MODEbits_t U6MODEbits __asm__ ("U6MODE") __attribute__((section("sfrs"), address(0xBF848A00)));
extern volatile uint32_t        U6MODECLR __attribute__((section("sfrs"),address(0xBF848A04)));
extern volatile uint32_t        U6MODESET __attribute__((section("sfrs"),address(0xBF848A08)));
extern volatile uint32_t        U6MODEINV __attribute__((section("sfrs"),address(0xBF848A0C)));
#define U6STA U6STA
extern volatile uint32_t   U6STA __attribute__((section("sfrs"), address(0xBF848A10)));
typedef union {
  struct {
    uint32_t URXDA:1;
    uint32_t OERR:1;
    uint32_t FERR:1;
    uint32_t PERR:1;
    uint32_t RIDLE:1;
    uint32_t ADDEN:1;
    uint32_t URXISEL:2;
    uint32_t TRMT:1;
    uint32_t UTXBF:1;
    uint32_t UTXEN:1;
    uint32_t UTXBRK:1;
    uint32_t URXEN:1;
    uint32_t UTXINV:1;
    uint32_t UTXISEL:2;
    uint32_t ADDR:8;
    uint32_t MASK:8;
  };
  struct {
    uint32_t :6;
    uint32_t URXISEL0:1;
    uint32_t URXISEL1:1;
    uint32_t :6;
    uint32_t UTXISEL0:1;
    uint32_t UTXISEL1:1;
  };
  struct {
    uint32_t :14;
    uint32_t UTXSEL:2;
  };
  struct {
    uint32_t w:32;
  };
} __U6STAbits_t;
extern volatile __U6STAbits_t U6STAbits __asm__ ("U6STA") __attribute__((section("sfrs"), address(0xBF848A10)));
extern volatile uint32_t        U6STACLR __attribute__((section("sfrs"),address(0xBF848A14)));
extern volatile uint32_t        U6STASET __attribute__((section("sfrs"),address(0xBF848A18)));
extern volatile uint32_t        U6STAINV __attribute__((section("sfrs"),address(0xBF848A1C)));
#define U6TXREG U6TXREG
extern volatile uint32_t   U6TXREG __attribute__((section("sfrs"), address(0xBF848A20)));
#define U6RXREG U6RXREG
extern volatile uint32_t   U6RXREG __attribute__((section("sfrs"), address(0xBF848A30)));
#define U6BRG U6BRG
extern volatile uint32_t   U6BRG __attribute__((section("sfrs"), address(0xBF848A40)));
typedef struct {
  uint32_t BRG:20;
} __U6BRGbits_t;
