Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpd100.h
extern volatile __ADCDSTATbits_t ADCDSTATbits __asm__ ("ADCDSTAT") __attribute__((section("sfrs"), address(0xBF887310)));
extern volatile uint32_t        ADCDSTATCLR __attribute__((section("sfrs"),address(0xBF887314)));
extern volatile uint32_t        ADCDSTATSET __attribute__((section("sfrs"),address(0xBF887318)));
extern volatile uint32_t        ADCDSTATINV __attribute__((section("sfrs"),address(0xBF88731C)));
#define ADCCNTB ADCCNTB
extern volatile uint32_t   ADCCNTB __attribute__((section("sfrs"), address(0xBF887320)));
typedef struct {
  uint32_t ADCCNTB:32;
} __ADCCNTBbits_t;
extern volatile __ADCCNTBbits_t ADCCNTBbits __asm__ ("ADCCNTB") __attribute__((section("sfrs"), address(0xBF887320)));
extern volatile uint32_t        ADCCNTBCLR __attribute__((section("sfrs"),address(0xBF887324)));
extern volatile uint32_t        ADCCNTBSET __attribute__((section("sfrs"),address(0xBF887328)));
extern volatile uint32_t        ADCCNTBINV __attribute__((section("sfrs"),address(0xBF88732C)));
#define ADCDMAB ADCDMAB
extern volatile uint32_t   ADCDMAB __attribute__((section("sfrs"), address(0xBF887330)));
typedef struct {
  uint32_t ADCDMAB:32;
} __ADCDMABbits_t;
extern volatile __ADCDMABbits_t ADCDMABbits __asm__ ("ADCDMAB") __attribute__((section("sfrs"), address(0xBF887330)));
extern volatile uint32_t        ADCDMABCLR __attribute__((section("sfrs"),address(0xBF887334)));
extern volatile uint32_t        ADCDMABSET __attribute__((section("sfrs"),address(0xBF887338)));
extern volatile uint32_t        ADCDMABINV __attribute__((section("sfrs"),address(0xBF88733C)));
#define ADCTRGSNS ADCTRGSNS
extern volatile uint32_t   ADCTRGSNS __attribute__((section("sfrs"), address(0xBF887340)));
typedef struct {
  uint32_t LVL0:1;
  uint32_t LVL1:1;
  uint32_t LVL2:1;
  uint32_t LVL3:1;
  uint32_t LVL4:1;
  uint32_t LVL5:1;
  uint32_t LVL6:1;
  uint32_t LVL7:1;
  uint32_t LVL8:1;
  uint32_t LVL9:1;
  uint32_t LVL10:1;
  uint32_t LVL11:1;
  uint32_t LVL12:1;
  uint32_t LVL13:1;
  uint32_t LVL14:1;
  uint32_t LVL15:1;
  uint32_t LVL16:1;
  uint32_t LVL17:1;
  uint32_t LVL18:1;
  uint32_t LVL19:1;
  uint32_t LVL20:1;
  uint32_t LVL21:1;
  uint32_t LVL22:1;
  uint32_t LVL23:1;
  uint32_t LVL24:1;
  uint32_t LVL25:1;
  uint32_t LVL26:1;
  uint32_t LVL27:1;
} __ADCTRGSNSbits_t;
extern volatile __ADCTRGSNSbits_t ADCTRGSNSbits __asm__ ("ADCTRGSNS") __attribute__((section("sfrs"), address(0xBF887340)));
extern volatile uint32_t        ADCTRGSNSCLR __attribute__((section("sfrs"),address(0xBF887344)));
extern volatile uint32_t        ADCTRGSNSSET __attribute__((section("sfrs"),address(0xBF887348)));
extern volatile uint32_t        ADCTRGSNSINV __attribute__((section("sfrs"),address(0xBF88734C)));
#define ADC0TIME ADC0TIME
extern volatile uint32_t   ADC0TIME __attribute__((section("sfrs"), address(0xBF887350)));
typedef struct {
  uint32_t SAMC:10;
  uint32_t :6;
  uint32_t ADCDIV:7;
  uint32_t BCHEN:1;
  uint32_t SELRES:2;
  uint32_t ADCEIS:3;
} __ADC0TIMEbits_t;
extern volatile __ADC0TIMEbits_t ADC0TIMEbits __asm__ ("ADC0TIME") __attribute__((section("sfrs"), address(0xBF887350)));
extern volatile uint32_t        ADC0TIMECLR __attribute__((section("sfrs"),address(0xBF887354)));
extern volatile uint32_t        ADC0TIMESET __attribute__((section("sfrs"),address(0xBF887358)));
extern volatile uint32_t        ADC0TIMEINV __attribute__((section("sfrs"),address(0xBF88735C)));
#define ADC1TIME ADC1TIME
extern volatile uint32_t   ADC1TIME __attribute__((section("sfrs"), address(0xBF887360)));
typedef struct {
  uint32_t SAMC:10;
  uint32_t :6;
  uint32_t ADCDIV:7;
  uint32_t BCHEN:1;
  uint32_t SELRES:2;
  uint32_t ADCEIS:3;
} __ADC1TIMEbits_t;
extern volatile __ADC1TIMEbits_t ADC1TIMEbits __asm__ ("ADC1TIME") __attribute__((section("sfrs"), address(0xBF887360)));
extern volatile uint32_t        ADC1TIMECLR __attribute__((section("sfrs"),address(0xBF887364)));
extern volatile uint32_t        ADC1TIMESET __attribute__((section("sfrs"),address(0xBF887368)));
extern volatile uint32_t        ADC1TIMEINV __attribute__((section("sfrs"),address(0xBF88736C)));
#define ADC2TIME ADC2TIME
extern volatile uint32_t   ADC2TIME __attribute__((section("sfrs"), address(0xBF887370)));
typedef struct {
  uint32_t SAMC:10;
  uint32_t :6;
  uint32_t ADCDIV:7;
  uint32_t BCHEN:1;
  uint32_t SELRES:2;
  uint32_t ADCEIS:3;
} __ADC2TIMEbits_t;
extern volatile __ADC2TIMEbits_t ADC2TIMEbits __asm__ ("ADC2TIME") __attribute__((section("sfrs"), address(0xBF887370)));
extern volatile uint32_t        ADC2TIMECLR __attribute__((section("sfrs"),address(0xBF887374)));
extern volatile uint32_t        ADC2TIMESET __attribute__((section("sfrs"),address(0xBF887378)));
extern volatile uint32_t        ADC2TIMEINV __attribute__((section("sfrs"),address(0xBF88737C)));
#define ADC3TIME ADC3TIME
extern volatile uint32_t   ADC3TIME __attribute__((section("sfrs"), address(0xBF887380)));
typedef struct {
  uint32_t SAMC:10;
  uint32_t :6;
  uint32_t ADCDIV:7;
  uint32_t BCHEN:1;
  uint32_t SELRES:2;
  uint32_t ADCEIS:3;
} __ADC3TIMEbits_t;
extern volatile __ADC3TIMEbits_t ADC3TIMEbits __asm__ ("ADC3TIME") __attribute__((section("sfrs"), address(0xBF887380)));
extern volatile uint32_t        ADC3TIMECLR __attribute__((section("sfrs"),address(0xBF887384)));
extern volatile uint32_t        ADC3TIMESET __attribute__((section("sfrs"),address(0xBF887388)));
extern volatile uint32_t        ADC3TIMEINV __attribute__((section("sfrs"),address(0xBF88738C)));
#define ADC4TIME ADC4TIME
extern volatile uint32_t   ADC4TIME __attribute__((section("sfrs"), address(0xBF887390)));
typedef struct {
  uint32_t SAMC:10;
  uint32_t :6;
  uint32_t ADCDIV:7;
  uint32_t BCHEN:1;
  uint32_t SELRES:2;
  uint32_t ADCEIS:3;
} __ADC4TIMEbits_t;
extern volatile __ADC4TIMEbits_t ADC4TIMEbits __asm__ ("ADC4TIME") __attribute__((section("sfrs"), address(0xBF887390)));
extern volatile uint32_t        ADC4TIMECLR __attribute__((section("sfrs"),address(0xBF887394)));
extern volatile uint32_t        ADC4TIMESET __attribute__((section("sfrs"),address(0xBF887398)));
extern volatile uint32_t        ADC4TIMEINV __attribute__((section("sfrs"),address(0xBF88739C)));
#define ADC5TIME ADC5TIME
extern volatile uint32_t   ADC5TIME __attribute__((section("sfrs"), address(0xBF8873A0)));
typedef struct {
  uint32_t SAMC:10;
  uint32_t :6;
  uint32_t ADCDIV:7;
  uint32_t BCHEN:1;
  uint32_t SELRES:2;
  uint32_t ADCEIS:3;
} __ADC5TIMEbits_t;
extern volatile __ADC5TIMEbits_t ADC5TIMEbits __asm__ ("ADC5TIME") __attribute__((section("sfrs"), address(0xBF8873A0)));
extern volatile uint32_t        ADC5TIMECLR __attribute__((section("sfrs"),address(0xBF8873A4)));
extern volatile uint32_t        ADC5TIMESET __attribute__((section("sfrs"),address(0xBF8873A8)));
extern volatile uint32_t        ADC5TIMEINV __attribute__((section("sfrs"),address(0xBF8873AC)));
#define ADCEIEN1 ADCEIEN1
extern volatile uint32_t   ADCEIEN1 __attribute__((section("sfrs"), address(0xBF8873C0)));
typedef struct {
  uint32_t EIEN0:1;
  uint32_t EIEN1:1;
  uint32_t EIEN2:1;
  uint32_t EIEN3:1;
  uint32_t EIEN4:1;
  uint32_t EIEN5:1;
  uint32_t EIEN6:1;
  uint32_t EIEN7:1;
  uint32_t EIEN8:1;
  uint32_t EIEN9:1;
  uint32_t EIEN10:1;
  uint32_t EIEN11:1;
  uint32_t EIEN12:1;
  uint32_t EIEN13:1;
  uint32_t EIEN14:1;
  uint32_t EIEN15:1;
  uint32_t EIEN16:1;
  uint32_t EIEN17:1;
  uint32_t EIEN18:1;
  uint32_t EIEN19:1;
  uint32_t EIEN20:1;
  uint32_t EIEN21:1;
  uint32_t EIEN22:1;
  uint32_t EIEN23:1;
  uint32_t EIEN24:1;
  uint32_t EIEN25:1;
  uint32_t EIEN26:1;
  uint32_t EIEN27:1;
} __ADCEIEN1bits_t;
extern volatile __ADCEIEN1bits_t ADCEIEN1bits __asm__ ("ADCEIEN1") __attribute__((section("sfrs"), address(0xBF8873C0)));
extern volatile uint32_t        ADCEIEN1CLR __attribute__((section("sfrs"),address(0xBF8873C4)));
extern volatile uint32_t        ADCEIEN1SET __attribute__((section("sfrs"),address(0xBF8873C8)));
extern volatile uint32_t        ADCEIEN1INV __attribute__((section("sfrs"),address(0xBF8873CC)));
#define ADCEIEN2 ADCEIEN2
extern volatile uint32_t   ADCEIEN2 __attribute__((section("sfrs"), address(0xBF8873D0)));
typedef struct {
  uint32_t :1;
  uint32_t EIEN33:1;
  uint32_t EIEN34:1;
  uint32_t EIEN35:1;
  uint32_t EIEN36:1;
  uint32_t EIEN37:1;
  uint32_t EIEN38:1;
  uint32_t EIEN39:1;
  uint32_t EIEN40:1;
  uint32_t EIEN41:1;
  uint32_t :3;
  uint32_t EIEN45:1;
  uint32_t EIEN46:1;
  uint32_t EIEN47:1;
  uint32_t EIEN48:1;
  uint32_t EIEN49:1;
  uint32_t EIEN50:1;
  uint32_t EIEN51:1;
  uint32_t EIEN52:1;
  uint32_t EIEN53:1;
} __ADCEIEN2bits_t;
extern volatile __ADCEIEN2bits_t ADCEIEN2bits __asm__ ("ADCEIEN2") __attribute__((section("sfrs"), address(0xBF8873D0)));
extern volatile uint32_t        ADCEIEN2CLR __attribute__((section("sfrs"),address(0xBF8873D4)));
extern volatile uint32_t        ADCEIEN2SET __attribute__((section("sfrs"),address(0xBF8873D8)));
extern volatile uint32_t        ADCEIEN2INV __attribute__((section("sfrs"),address(0xBF8873DC)));
#define ADCEISTAT1 ADCEISTAT1
extern volatile uint32_t   ADCEISTAT1 __attribute__((section("sfrs"), address(0xBF8873E0)));
typedef struct {
  uint32_t EIRDY0:1;
  uint32_t EIRDY1:1;
  uint32_t EIRDY2:1;
  uint32_t EIRDY3:1;
  uint32_t EIRDY4:1;
  uint32_t EIRDY5:1;
  uint32_t EIRDY6:1;
  uint32_t EIRDY7:1;
  uint32_t EIRDY8:1;
  uint32_t EIRDY9:1;
  uint32_t EIRDY10:1;
  uint32_t EIRDY11:1;
  uint32_t EIRDY12:1;
  uint32_t EIRDY13:1;
  uint32_t EIRDY14:1;
  uint32_t EIRDY15:1;
  uint32_t EIRDY16:1;
  uint32_t EIRDY17:1;
  uint32_t EIRDY18:1;
  uint32_t EIRDY19:1;
  uint32_t EIRDY20:1;
  uint32_t EIRDY21:1;
  uint32_t EIRDY22:1;
  uint32_t EIRDY23:1;
  uint32_t EIRDY24:1;
  uint32_t EIRDY25:1;
  uint32_t EIRDY26:1;
  uint32_t EIRDY27:1;
} __ADCEISTAT1bits_t;
extern volatile __ADCEISTAT1bits_t ADCEISTAT1bits __asm__ ("ADCEISTAT1") __attribute__((section("sfrs"), address(0xBF8873E0)));
extern volatile uint32_t        ADCEISTAT1CLR __attribute__((section("sfrs"),address(0xBF8873E4)));
extern volatile uint32_t        ADCEISTAT1SET __attribute__((section("sfrs"),address(0xBF8873E8)));
extern volatile uint32_t        ADCEISTAT1INV __attribute__((section("sfrs"),address(0xBF8873EC)));
#define ADCEISTAT2 ADCEISTAT2
extern volatile uint32_t   ADCEISTAT2 __attribute__((section("sfrs"), address(0xBF8873F0)));
typedef struct {
  uint32_t :1;
  uint32_t EIRDY33:1;
  uint32_t EIRDY34:1;
  uint32_t EIRDY35:1;
  uint32_t EIRDY36:1;
  uint32_t EIRDY37:1;
  uint32_t EIRDY38:1;
  uint32_t EIRDY39:1;
  uint32_t EIRDY40:1;
  uint32_t EIRDY41:1;
  uint32_t :3;
  uint32_t EIRDY45:1;
  uint32_t EIRDY46:1;
  uint32_t EIRDY47:1;
  uint32_t EIRDY48:1;
  uint32_t EIRDY49:1;
  uint32_t EIRDY50:1;
  uint32_t EIRDY51:1;
  uint32_t EIRDY52:1;
  uint32_t EIRDY53:1;
} __ADCEISTAT2bits_t;
extern volatile __ADCEISTAT2bits_t ADCEISTAT2bits __asm__ ("ADCEISTAT2") __attribute__((section("sfrs"), address(0xBF8873F0)));
extern volatile uint32_t        ADCEISTAT2CLR __attribute__((section("sfrs"),address(0xBF8873F4)));
extern volatile uint32_t        ADCEISTAT2SET __attribute__((section("sfrs"),address(0xBF8873F8)));
extern volatile uint32_t        ADCEISTAT2INV __attribute__((section("sfrs"),address(0xBF8873FC)));
#define ADCANCON ADCANCON
extern volatile uint32_t   ADCANCON __attribute__((section("sfrs"), address(0xBF887400)));
typedef struct {
  uint32_t ANEN0:1;
  uint32_t ANEN1:1;
  uint32_t ANEN2:1;
  uint32_t ANEN3:1;
  uint32_t ANEN4:1;
  uint32_t ANEN5:1;
  uint32_t :1;
  uint32_t ANEN7:1;
  uint32_t WKRDY0:1;
  uint32_t WKRDY1:1;
  uint32_t WKRDY2:1;
  uint32_t WKRDY3:1;
  uint32_t WKRDY4:1;
  uint32_t WKRDY5:1;
  uint32_t :1;
  uint32_t WKRDY7:1;
  uint32_t WKIEN0:1;
  uint32_t WKIEN1:1;
  uint32_t WKIEN2:1;
  uint32_t WKIEN3:1;
  uint32_t WKIEN4:1;
  uint32_t WKIEN5:1;
  uint32_t :1;
  uint32_t WKIEN7:1;
  uint32_t WKUPCLKCNT:4;
} __ADCANCONbits_t;
