Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpd100.h
extern volatile __DSGPR0bits_t DSGPR0bits __asm__ ("DSGPR0") __attribute__((section("sfrs"), address(0xBF8C0208)));
#define DSGPR1 DSGPR1
extern volatile uint32_t   DSGPR1 __attribute__((section("sfrs"), address(0xBF8C0210)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR1bits_t;
extern volatile __DSGPR1bits_t DSGPR1bits __asm__ ("DSGPR1") __attribute__((section("sfrs"), address(0xBF8C0210)));
#define DSGPR2 DSGPR2
extern volatile uint32_t   DSGPR2 __attribute__((section("sfrs"), address(0xBF8C0214)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR2bits_t;
extern volatile __DSGPR2bits_t DSGPR2bits __asm__ ("DSGPR2") __attribute__((section("sfrs"), address(0xBF8C0214)));
#define DSGPR3 DSGPR3
extern volatile uint32_t   DSGPR3 __attribute__((section("sfrs"), address(0xBF8C0218)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR3bits_t;
extern volatile __DSGPR3bits_t DSGPR3bits __asm__ ("DSGPR3") __attribute__((section("sfrs"), address(0xBF8C0218)));
#define DSGPR4 DSGPR4
extern volatile uint32_t   DSGPR4 __attribute__((section("sfrs"), address(0xBF8C021C)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR4bits_t;
extern volatile __DSGPR4bits_t DSGPR4bits __asm__ ("DSGPR4") __attribute__((section("sfrs"), address(0xBF8C021C)));
#define DSGPR5 DSGPR5
extern volatile uint32_t   DSGPR5 __attribute__((section("sfrs"), address(0xBF8C0220)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR5bits_t;
extern volatile __DSGPR5bits_t DSGPR5bits __asm__ ("DSGPR5") __attribute__((section("sfrs"), address(0xBF8C0220)));
#define DSGPR6 DSGPR6
extern volatile uint32_t   DSGPR6 __attribute__((section("sfrs"), address(0xBF8C0224)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR6bits_t;
extern volatile __DSGPR6bits_t DSGPR6bits __asm__ ("DSGPR6") __attribute__((section("sfrs"), address(0xBF8C0224)));
#define DSGPR7 DSGPR7
extern volatile uint32_t   DSGPR7 __attribute__((section("sfrs"), address(0xBF8C0228)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR7bits_t;
extern volatile __DSGPR7bits_t DSGPR7bits __asm__ ("DSGPR7") __attribute__((section("sfrs"), address(0xBF8C0228)));
#define DSGPR8 DSGPR8
extern volatile uint32_t   DSGPR8 __attribute__((section("sfrs"), address(0xBF8C022C)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR8bits_t;
extern volatile __DSGPR8bits_t DSGPR8bits __asm__ ("DSGPR8") __attribute__((section("sfrs"), address(0xBF8C022C)));
#define DSGPR9 DSGPR9
extern volatile uint32_t   DSGPR9 __attribute__((section("sfrs"), address(0xBF8C0230)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR9bits_t;
extern volatile __DSGPR9bits_t DSGPR9bits __asm__ ("DSGPR9") __attribute__((section("sfrs"), address(0xBF8C0230)));
#define DSGPR10 DSGPR10
extern volatile uint32_t   DSGPR10 __attribute__((section("sfrs"), address(0xBF8C0234)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR10bits_t;
extern volatile __DSGPR10bits_t DSGPR10bits __asm__ ("DSGPR10") __attribute__((section("sfrs"), address(0xBF8C0234)));
#define DSGPR11 DSGPR11
extern volatile uint32_t   DSGPR11 __attribute__((section("sfrs"), address(0xBF8C0238)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR11bits_t;
extern volatile __DSGPR11bits_t DSGPR11bits __asm__ ("DSGPR11") __attribute__((section("sfrs"), address(0xBF8C0238)));
#define DSGPR12 DSGPR12
extern volatile uint32_t   DSGPR12 __attribute__((section("sfrs"), address(0xBF8C023C)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR12bits_t;
extern volatile __DSGPR12bits_t DSGPR12bits __asm__ ("DSGPR12") __attribute__((section("sfrs"), address(0xBF8C023C)));
#define DSGPR13 DSGPR13
extern volatile uint32_t   DSGPR13 __attribute__((section("sfrs"), address(0xBF8C0240)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR13bits_t;
extern volatile __DSGPR13bits_t DSGPR13bits __asm__ ("DSGPR13") __attribute__((section("sfrs"), address(0xBF8C0240)));
#define DSGPR14 DSGPR14
extern volatile uint32_t   DSGPR14 __attribute__((section("sfrs"), address(0xBF8C0244)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR14bits_t;
extern volatile __DSGPR14bits_t DSGPR14bits __asm__ ("DSGPR14") __attribute__((section("sfrs"), address(0xBF8C0244)));
#define DSGPR15 DSGPR15
extern volatile uint32_t   DSGPR15 __attribute__((section("sfrs"), address(0xBF8C0248)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR15bits_t;
extern volatile __DSGPR15bits_t DSGPR15bits __asm__ ("DSGPR15") __attribute__((section("sfrs"), address(0xBF8C0248)));
#define DSGPR16 DSGPR16
extern volatile uint32_t   DSGPR16 __attribute__((section("sfrs"), address(0xBF8C024C)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR16bits_t;
extern volatile __DSGPR16bits_t DSGPR16bits __asm__ ("DSGPR16") __attribute__((section("sfrs"), address(0xBF8C024C)));
#define DSGPR17 DSGPR17
extern volatile uint32_t   DSGPR17 __attribute__((section("sfrs"), address(0xBF8C0250)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR17bits_t;
extern volatile __DSGPR17bits_t DSGPR17bits __asm__ ("DSGPR17") __attribute__((section("sfrs"), address(0xBF8C0250)));
#define DSGPR18 DSGPR18
extern volatile uint32_t   DSGPR18 __attribute__((section("sfrs"), address(0xBF8C0254)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR18bits_t;
extern volatile __DSGPR18bits_t DSGPR18bits __asm__ ("DSGPR18") __attribute__((section("sfrs"), address(0xBF8C0254)));
#define DSGPR19 DSGPR19
extern volatile uint32_t   DSGPR19 __attribute__((section("sfrs"), address(0xBF8C0258)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR19bits_t;
extern volatile __DSGPR19bits_t DSGPR19bits __asm__ ("DSGPR19") __attribute__((section("sfrs"), address(0xBF8C0258)));
#define DSGPR20 DSGPR20
extern volatile uint32_t   DSGPR20 __attribute__((section("sfrs"), address(0xBF8C025C)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR20bits_t;
extern volatile __DSGPR20bits_t DSGPR20bits __asm__ ("DSGPR20") __attribute__((section("sfrs"), address(0xBF8C025C)));
#define DSGPR21 DSGPR21
extern volatile uint32_t   DSGPR21 __attribute__((section("sfrs"), address(0xBF8C0260)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR21bits_t;
extern volatile __DSGPR21bits_t DSGPR21bits __asm__ ("DSGPR21") __attribute__((section("sfrs"), address(0xBF8C0260)));
#define DSGPR22 DSGPR22
extern volatile uint32_t   DSGPR22 __attribute__((section("sfrs"), address(0xBF8C0264)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR22bits_t;
extern volatile __DSGPR22bits_t DSGPR22bits __asm__ ("DSGPR22") __attribute__((section("sfrs"), address(0xBF8C0264)));
#define DSGPR23 DSGPR23
extern volatile uint32_t   DSGPR23 __attribute__((section("sfrs"), address(0xBF8C0268)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR23bits_t;
