Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpd100.h
#define _CNNEG_CNNEG0_POSITION                   0x00000000
#define _CNNEG_CNNEG0_MASK                       0x00000001
#define _CNNEG_CNNEG0_LENGTH                     0x00000001

#define _CNNEG_CNNEG1_POSITION                   0x00000001
#define _CNNEG_CNNEG1_MASK                       0x00000002
#define _CNNEG_CNNEG1_LENGTH                     0x00000001

#define _CNNEG_CNNEG6_POSITION                   0x00000006
#define _CNNEG_CNNEG6_MASK                       0x00000040
#define _CNNEG_CNNEG6_LENGTH                     0x00000001

#define _CNNEG_CNNEG7_POSITION                   0x00000007
#define _CNNEG_CNNEG7_MASK                       0x00000080
#define _CNNEG_CNNEG7_LENGTH                     0x00000001

#define _CNNEG_CNNEG8_POSITION                   0x00000008
#define _CNNEG_CNNEG8_MASK                       0x00000100
#define _CNNEG_CNNEG8_LENGTH                     0x00000001

#define _CNNEG_CNNEG9_POSITION                   0x00000009
#define _CNNEG_CNNEG9_MASK                       0x00000200
#define _CNNEG_CNNEG9_LENGTH                     0x00000001

#define _CNNEG_CNNEG10_POSITION                  0x0000000A
#define _CNNEG_CNNEG10_MASK                      0x00000400
#define _CNNEG_CNNEG10_LENGTH                    0x00000001

#define _CNNEG_CNNEG11_POSITION                  0x0000000B
#define _CNNEG_CNNEG11_MASK                      0x00000800
#define _CNNEG_CNNEG11_LENGTH                    0x00000001

#define _CNNEG_CNNEG12_POSITION                  0x0000000C
#define _CNNEG_CNNEG12_MASK                      0x00001000
#define _CNNEG_CNNEG12_LENGTH                    0x00000001

#define _CNNEG_CNNEG13_POSITION                  0x0000000D
#define _CNNEG_CNNEG13_MASK                      0x00002000
#define _CNNEG_CNNEG13_LENGTH                    0x00000001

#define _CNNEG_CNNEG14_POSITION                  0x0000000E
#define _CNNEG_CNNEG14_MASK                      0x00004000
#define _CNNEG_CNNEG14_LENGTH                    0x00000001

#define _CNNEG_CNNEG15_POSITION                  0x0000000F
#define _CNNEG_CNNEG15_MASK                      0x00008000
#define _CNNEG_CNNEG15_LENGTH                    0x00000001

#define _CNFG_CNFG0_POSITION                     0x00000000
#define _CNFG_CNFG0_MASK                         0x00000001
#define _CNFG_CNFG0_LENGTH                       0x00000001

#define _CNFG_CNFG1_POSITION                     0x00000001
#define _CNFG_CNFG1_MASK                         0x00000002
#define _CNFG_CNFG1_LENGTH                       0x00000001

#define _CNFG_CNFG6_POSITION                     0x00000006
#define _CNFG_CNFG6_MASK                         0x00000040
#define _CNFG_CNFG6_LENGTH                       0x00000001

#define _CNFG_CNFG7_POSITION                     0x00000007
#define _CNFG_CNFG7_MASK                         0x00000080
#define _CNFG_CNFG7_LENGTH                       0x00000001

#define _CNFG_CNFG8_POSITION                     0x00000008
#define _CNFG_CNFG8_MASK                         0x00000100
#define _CNFG_CNFG8_LENGTH                       0x00000001

#define _CNFG_CNFG9_POSITION                     0x00000009
#define _CNFG_CNFG9_MASK                         0x00000200
#define _CNFG_CNFG9_LENGTH                       0x00000001

#define _CNFG_CNFG10_POSITION                    0x0000000A
#define _CNFG_CNFG10_MASK                        0x00000400
#define _CNFG_CNFG10_LENGTH                      0x00000001

#define _CNFG_CNFG11_POSITION                    0x0000000B
#define _CNFG_CNFG11_MASK                        0x00000800
#define _CNFG_CNFG11_LENGTH                      0x00000001

#define _CNFG_CNFG12_POSITION                    0x0000000C
#define _CNFG_CNFG12_MASK                        0x00001000
#define _CNFG_CNFG12_LENGTH                      0x00000001

#define _CNFG_CNFG13_POSITION                    0x0000000D
#define _CNFG_CNFG13_MASK                        0x00002000
#define _CNFG_CNFG13_LENGTH                      0x00000001

#define _CNFG_CNFG14_POSITION                    0x0000000E
#define _CNFG_CNFG14_MASK                        0x00004000
#define _CNFG_CNFG14_LENGTH                      0x00000001

#define _CNFG_CNFG15_POSITION                    0x0000000F
#define _CNFG_CNFG15_MASK                        0x00008000
#define _CNFG_CNFG15_LENGTH                      0x00000001

#define _ADCCON1_DMABL_POSITION                  0x00000000
#define _ADCCON1_DMABL_MASK                      0x00000007
#define _ADCCON1_DMABL_LENGTH                    0x00000003

#define _ADCCON1_STRGLVL_POSITION                0x00000003
#define _ADCCON1_STRGLVL_MASK                    0x00000008
#define _ADCCON1_STRGLVL_LENGTH                  0x00000001

#define _ADCCON1_IRQVS_POSITION                  0x00000004
#define _ADCCON1_IRQVS_MASK                      0x00000070
#define _ADCCON1_IRQVS_LENGTH                    0x00000003

#define _ADCCON1_FSPBCLKEN_POSITION              0x00000009
#define _ADCCON1_FSPBCLKEN_MASK                  0x00000200
#define _ADCCON1_FSPBCLKEN_LENGTH                0x00000001

#define _ADCCON1_FSSCLKEN_POSITION               0x0000000A
#define _ADCCON1_FSSCLKEN_MASK                   0x00000400
#define _ADCCON1_FSSCLKEN_LENGTH                 0x00000001

#define _ADCCON1_CVDEN_POSITION                  0x0000000B
#define _ADCCON1_CVDEN_MASK                      0x00000800
#define _ADCCON1_CVDEN_LENGTH                    0x00000001

#define _ADCCON1_AICPMPEN_POSITION               0x0000000C
#define _ADCCON1_AICPMPEN_MASK                   0x00001000
#define _ADCCON1_AICPMPEN_LENGTH                 0x00000001

#define _ADCCON1_SIDL_POSITION                   0x0000000D
#define _ADCCON1_SIDL_MASK                       0x00002000
#define _ADCCON1_SIDL_LENGTH                     0x00000001

#define _ADCCON1_ON_POSITION                     0x0000000F
#define _ADCCON1_ON_MASK                         0x00008000
#define _ADCCON1_ON_LENGTH                       0x00000001

#define _ADCCON1_STRGSRC_POSITION                0x00000010
#define _ADCCON1_STRGSRC_MASK                    0x001F0000
#define _ADCCON1_STRGSRC_LENGTH                  0x00000005

