Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpd100.h
#define _ADCDSTAT1_ARDY0_POSITION                0x00000000
#define _ADCDSTAT1_ARDY0_MASK                    0x00000001
#define _ADCDSTAT1_ARDY0_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY1_POSITION                0x00000001
#define _ADCDSTAT1_ARDY1_MASK                    0x00000002
#define _ADCDSTAT1_ARDY1_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY2_POSITION                0x00000002
#define _ADCDSTAT1_ARDY2_MASK                    0x00000004
#define _ADCDSTAT1_ARDY2_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY3_POSITION                0x00000003
#define _ADCDSTAT1_ARDY3_MASK                    0x00000008
#define _ADCDSTAT1_ARDY3_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY4_POSITION                0x00000004
#define _ADCDSTAT1_ARDY4_MASK                    0x00000010
#define _ADCDSTAT1_ARDY4_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY5_POSITION                0x00000005
#define _ADCDSTAT1_ARDY5_MASK                    0x00000020
#define _ADCDSTAT1_ARDY5_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY6_POSITION                0x00000006
#define _ADCDSTAT1_ARDY6_MASK                    0x00000040
#define _ADCDSTAT1_ARDY6_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY7_POSITION                0x00000007
#define _ADCDSTAT1_ARDY7_MASK                    0x00000080
#define _ADCDSTAT1_ARDY7_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY8_POSITION                0x00000008
#define _ADCDSTAT1_ARDY8_MASK                    0x00000100
#define _ADCDSTAT1_ARDY8_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY9_POSITION                0x00000009
#define _ADCDSTAT1_ARDY9_MASK                    0x00000200
#define _ADCDSTAT1_ARDY9_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY10_POSITION               0x0000000A
#define _ADCDSTAT1_ARDY10_MASK                   0x00000400
#define _ADCDSTAT1_ARDY10_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY11_POSITION               0x0000000B
#define _ADCDSTAT1_ARDY11_MASK                   0x00000800
#define _ADCDSTAT1_ARDY11_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY12_POSITION               0x0000000C
#define _ADCDSTAT1_ARDY12_MASK                   0x00001000
#define _ADCDSTAT1_ARDY12_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY13_POSITION               0x0000000D
#define _ADCDSTAT1_ARDY13_MASK                   0x00002000
#define _ADCDSTAT1_ARDY13_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY14_POSITION               0x0000000E
#define _ADCDSTAT1_ARDY14_MASK                   0x00004000
#define _ADCDSTAT1_ARDY14_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY15_POSITION               0x0000000F
#define _ADCDSTAT1_ARDY15_MASK                   0x00008000
#define _ADCDSTAT1_ARDY15_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY16_POSITION               0x00000010
#define _ADCDSTAT1_ARDY16_MASK                   0x00010000
#define _ADCDSTAT1_ARDY16_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY17_POSITION               0x00000011
#define _ADCDSTAT1_ARDY17_MASK                   0x00020000
#define _ADCDSTAT1_ARDY17_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY18_POSITION               0x00000012
#define _ADCDSTAT1_ARDY18_MASK                   0x00040000
#define _ADCDSTAT1_ARDY18_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY19_POSITION               0x00000013
#define _ADCDSTAT1_ARDY19_MASK                   0x00080000
#define _ADCDSTAT1_ARDY19_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY20_POSITION               0x00000014
#define _ADCDSTAT1_ARDY20_MASK                   0x00100000
#define _ADCDSTAT1_ARDY20_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY21_POSITION               0x00000015
#define _ADCDSTAT1_ARDY21_MASK                   0x00200000
#define _ADCDSTAT1_ARDY21_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY22_POSITION               0x00000016
#define _ADCDSTAT1_ARDY22_MASK                   0x00400000
#define _ADCDSTAT1_ARDY22_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY23_POSITION               0x00000017
#define _ADCDSTAT1_ARDY23_MASK                   0x00800000
#define _ADCDSTAT1_ARDY23_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY24_POSITION               0x00000018
#define _ADCDSTAT1_ARDY24_MASK                   0x01000000
#define _ADCDSTAT1_ARDY24_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY25_POSITION               0x00000019
#define _ADCDSTAT1_ARDY25_MASK                   0x02000000
#define _ADCDSTAT1_ARDY25_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY26_POSITION               0x0000001A
#define _ADCDSTAT1_ARDY26_MASK                   0x04000000
#define _ADCDSTAT1_ARDY26_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY27_POSITION               0x0000001B
#define _ADCDSTAT1_ARDY27_MASK                   0x08000000
#define _ADCDSTAT1_ARDY27_LENGTH                 0x00000001

#define _ADCDSTAT2_ARDY33_POSITION               0x00000001
#define _ADCDSTAT2_ARDY33_MASK                   0x00000002
#define _ADCDSTAT2_ARDY33_LENGTH                 0x00000001

#define _ADCDSTAT2_ARDY34_POSITION               0x00000002
#define _ADCDSTAT2_ARDY34_MASK                   0x00000004
#define _ADCDSTAT2_ARDY34_LENGTH                 0x00000001

#define _ADCDSTAT2_ARDY35_POSITION               0x00000003
#define _ADCDSTAT2_ARDY35_MASK                   0x00000008
#define _ADCDSTAT2_ARDY35_LENGTH                 0x00000001

#define _ADCDSTAT2_ARDY36_POSITION               0x00000004
#define _ADCDSTAT2_ARDY36_MASK                   0x00000010
#define _ADCDSTAT2_ARDY36_LENGTH                 0x00000001

#define _ADCDSTAT2_ARDY37_POSITION               0x00000005
#define _ADCDSTAT2_ARDY37_MASK                   0x00000020
#define _ADCDSTAT2_ARDY37_LENGTH                 0x00000001

#define _ADCDSTAT2_ARDY38_POSITION               0x00000006
#define _ADCDSTAT2_ARDY38_MASK                   0x00000040
#define _ADCDSTAT2_ARDY38_LENGTH                 0x00000001

#define _ADCDSTAT2_ARDY39_POSITION               0x00000007
#define _ADCDSTAT2_ARDY39_MASK                   0x00000080
#define _ADCDSTAT2_ARDY39_LENGTH                 0x00000001

#define _ADCDSTAT2_ARDY40_POSITION               0x00000008
#define _ADCDSTAT2_ARDY40_MASK                   0x00000100
#define _ADCDSTAT2_ARDY40_LENGTH                 0x00000001

